
'use strict'
{
  ////    ↓オブジェクト↓    /////
  const udewa = {
    "VIP腕輪祝福": 55000,
    "VIP腕輪通常": 50000,
    "VIP腕輪呪い": 40000,
    "VIP腕輪祝福・買": 19250,
    "VIP腕輪通常・買": 17500,
    "VIP腕輪呪い・買": 14000,
  
    "祝福,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪": 33000,
    "通常,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪": 30000,
    "呪い,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪": 24000,
    "祝福,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪・買取り": 11550,
    "通常,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪・買取り": 10500,
    "呪い,鑑定師の腕輪、透視の腕輪、マタギの腕輪、無心の腕輪・買取り": 8400,
  
    "祝福のしあわせ、時たたず、弾きよけ、浮遊の腕輪": 11000,
    "通常のしあわせ、時たたず、弾きよけ、浮遊の腕輪": 10000,
    "呪いのしあわせ、時たたず、弾きよけ、浮遊の腕輪": 8000,
    "祝福のしあわせ、時たたず、弾きよけ、浮遊の腕輪・買取り": 3850,
    "通常のしあわせ、時たたず、弾きよけ、浮遊の腕輪・買取り": 3500,
    "呪いのしあわせ、時たたず、弾きよけ、浮遊の腕輪・買取り": 2800,
  
    "祝福の裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪": 5500,
    "通常の裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪": 5000,
    "呪いの裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪": 4000,
    "祝福の裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪・買取り": 1925,
    "通常の裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪・買取り": 1750,
    "呪いの裏道、回復、壁抜け、気配察知、気配察血、高飛び、道具感知、道具感血、ノナリー、爆発、水グモの腕輪・買取り": 1400,
  
    "祝福の混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪": 3300,
    "通常の混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪": 3000,
    "呪いの混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪": 2400,
    "祝福の混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪・買取り": 1155,
    "通常の混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪・買取り": 1050,
    "呪いの混乱よけ、睡眠よけ、痛恨、透ネ見、毒消し、呪いよけ、保持、呪い師、魔物呼び、ワナの腕輪・買取り": 840,
  
    "祝福の遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪": 2200,
    "通常の遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪": 2000,
    "呪いの遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪": 1600,
    "祝福の遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪・買取り": 770,
    "通常の遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪・買取り": 700,
    "呪いの遠投の腕輪、ちからの腕輪、武器束ねの腕輪、ヘタ投げの腕輪・買取り": 560,
    
  };
  const makimono = {

    "祝福,ねだやしの巻物": 11000,
    "通常,ねだやしの巻物": 10000,
    "封印,ねだやしの巻物": 8000,
    "祝福,ねだやしの巻物・買取り": 3850,
    "通常,ねだやしの巻物・買取り": 3500,
    "封印,ねだやしの巻物・買取り": 2800,

    "祝福,白紙の巻物": 5500,
    "通常,白紙の巻物": 5000,
    "封印,白紙の巻物": 4000,
    "祝福,白紙の巻物・買取り": 1925,
    "通常,白紙の巻物・買取り": 1750,
    "封印,白紙の巻物・買取り": 1400,

    "祝福の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物": 3300,
    "通常の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物": 3000,
    "封印の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物": 2400,
    "祝福の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物・買取り": 1155,
    "通常の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物・買取り": 1050,
    "封印の金滅の巻物、聖域の巻物、全滅の巻物、迷子の巻物・買取り": 840,

    "祝福の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物": 1100,
    "通常の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物": 1000,
    "封印の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物": 800,
    "祝福の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物・買取り": 385,
    "通常の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物・買取り": 350,
    "封印の枝回復、オーラ消し、国った時、困った時、混乱、真空斬り、昼夜、敵加速、バクスイ、バクチ、魔物部屋、予防、技回復の巻物・買取り": 280,

    "祝福のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物": 880,
    "通常のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物": 800,
    "封印のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物": 640,
    "祝福のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物・買取り": 308,
    "通常のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物・買取り": 280,
    "封印のくちなし、ゾワゾワ、ひきよせ、拾えず、水がれ、ワナ消し、ワナの巻物・買取り": 224,

    "祝福の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物": 550,
    "通常の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物": 500,
    "封印の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物": 400,
    "祝福の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物・買取り": 192,
    "通常の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物・買取り": 175,
    "封印の夫の恵み、おにぎり、おはらい、換金、祝福、吸い出し、タグ、たたり、タダ、他の恵み、地の恵み、壺増犬、壺増大、天の恵み、メッキの巻物・買取り": 140,

    "祝福のいかすしの巻物、集合の巻物、道具寄せの巻物": 330,
    "通常のいかすしの巻物、集合の巻物、道具寄せの巻物": 300,
    "封印のいかすしの巻物、集合の巻物、道具寄せの巻物": 240,
    "祝福のいかすしの巻物、集合の巻物、道具寄せの巻物・買取り": 115,
    "通常のいかすしの巻物、集合の巻物、道具寄せの巻物・買取り": 105,
    "封印のいかすしの巻物、集合の巻物、道具寄せの巻物・買取り": 84,

    "祝福,識別の巻物": 220,
    "通常,識別の巻物": 200,
    "封印,識別の巻物": 160,
    "祝福,識別の巻物・買取り": 77,
    "通常,識別の巻物・買取り": 70,
    "封印,識別の巻物・買取り": 56,

    "祝福のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物": 110,
    "通常のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物": 100,
    "封印のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物": 80,
    "祝福のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物・買取り": 38,
    "通常のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物・買取り": 35,
    "封印のあかりの巻物、オイルの巻物、紹介状、召介状、脱出の巻物、光の巻物・買取り": 28,

    "祝福のただの紙切れ、ぬれた巻物": 11,
    "通常のただの紙切れ、ぬれた巻物": 10,
    "封印のただの紙切れ、ぬれた巻物": 8,
    "祝福のただの紙切れ、ぬれた巻物・買取り": 3,
    "通常のただの紙切れ、ぬれた巻物・買取り": 3,
    "封印のただの紙切れ、ぬれた巻物・買取り": 2,

  };
  const kusa = {
    "祝福の超不幸の種、天使の種": 5500,
    "通常の超不幸の種、天使の種": 5000,
    "封印の超不幸の種、天使の種": 4000,
    "祝福の超不幸の種、天使の種・買取り": 1925,
    "通常の超不幸の種、天使の種・買取り": 1750,
    "封印の超不幸の種、天使の種・買取り": 1400,
    
    "祝福の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草": 2200,
    "通常の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草": 2000,
    "封印の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草": 1600,
    "祝福の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草・買取り": 770,
    "通常の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草・買取り": 700,
    "封印の忌火起草、しあわせ草、不幸の種、無敵草、物忘れの草・買取り": 560,
    
    "祝福のやりなおし草、やりなおせ草": 1650,
    "通常のやりなおし草、やりなおせ草": 1500,
    "封印のやりなおし草、やりなおせ草": 1200,
    "祝福のやりなおし草、やりなおせ草・買取り": 577,
    "通常のやりなおし草、やりなおせ草・買取り": 525,
    "封印のやりなおし草、やりなおせ草・買取り": 420,
    
    "祝福の腹活の草、復活の草": 1100,
    "通常の腹活の草、復活の草": 1000,
    "封印の腹活の草、復活の草": 800,
    "祝福の腹活の草、復活の草・買取り": 385,
    "通常の腹活の草、復活の草・買取り": 350,
    "封印の腹活の草、復活の草・買取り": 280,
    
    "祝福の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草": 550,
    "通常の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草": 500,
    "封印の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草": 400,
    "祝福の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草・買取り": 192,
    "通常の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草・買取り": 175,
    "封印の命の草、狂戦士の種、睡眠草、ちからの草、ドラコン草、ドラゴン草・買取り": 140,
    
    "祝福の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草": 330,
    "通常の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草": 300,
    "封印の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草": 240,
    "祝福の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草・買取り": 115,
    "通常の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草・買取り": 105,
    "封印の胃拡張の種、胃縮小の種、混乱草、すばやさ草、成長の種、ぬぐすり草、パワーアップ草、めぐすり草、目つぶし草・買取り": 84,
    
    "祝福のいやし草": 220,
    "通常のいやし草": 200,
    "封印のいやし草": 160,
    "祝福のいやし草・買取り": 77,
    "通常のいやし草・買取り": 70,
    "封印のいやし草・買取り": 56,
    
    "祝福の弟切草、高飛び草、毒消し草、毒草": 110,
    "通常の弟切草、高飛び草、毒消し草、毒草": 100,
    "封印の弟切草、高飛び草、毒消し草、毒草": 80,
    "祝福の弟切草、高飛び草、毒消し草、毒草・買取り": 38,
    "通常の弟切草、高飛び草、毒消し草、毒草・買取り": 35,
    "封印の弟切草、高飛び草、毒消し草、毒草・買取り": 28,
    
    "祝福の薬草、楽草": 55,
    "通常の薬草、楽草": 50,
    "封印の薬草、楽草": 40,
    "祝福の薬草、楽草・買取り": 18,
    "通常の薬草、楽草・買取り": 17,
    "封印の薬草、楽草・買取り": 14,
    
    "祝福の雑草": 11,
    "通常の雑草": 10,
    "封印の雑草": 8,
    "祝福の雑草・買取り": 3,
    "通常の雑草・買取り": 3,
    "封印の雑草・買取り": 2,
    ...makimono,
  };
  const tuue = {
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福": 2574,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福": 2475,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福": 2376,
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福・買": 900,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福・買": 865,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖祝福・買": 831,
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常": 2340,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常": 2250,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常": 2160,
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常・買": 819,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常・買": 787,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖通常・買": 756,
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い": 1872,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い": 1800,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い": 1728,
    "[6]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い・買": 655,
    "[5]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い・買": 629,
    "[4]しあわせの杖、しわよせの杖、土塊の杖、トンネルの杖、不幸の杖呪い・買": 604,

    "[6]身伐わりの杖、封印の杖、身代わりの杖祝福": 2145,
    "[5]身伐わりの杖、封印の杖、身代わりの杖祝福": 2062,
    "[4]身伐わりの杖、封印の杖、身代わりの杖祝福": 1980,
    "[6]身伐わりの杖、封印の杖、身代わりの杖祝福・買": 750,
    "[5]身伐わりの杖、封印の杖、身代わりの杖祝福・買": 721,
    "[4]身伐わりの杖、封印の杖、身代わりの杖祝福・買": 693,
    "[6]身伐わりの杖、封印の杖、身代わりの杖通常": 1950,
    "[5]身伐わりの杖、封印の杖、身代わりの杖通常": 1875,
    "[4]身伐わりの杖、封印の杖、身代わりの杖通常": 1800,
    "[6]身伐わりの杖、封印の杖、身代わりの杖通常・買": 682,
    "[5]身伐わりの杖、封印の杖、身代わりの杖通常・買": 656,
    "[4]身伐わりの杖、封印の杖、身代わりの杖通常・買": 630,
    "[6]身伐わりの杖、封印の杖、身代わりの杖呪い": 1560,
    "[5]身伐わりの杖、封印の杖、身代わりの杖呪い": 1500,
    "[4]身伐わりの杖、封印の杖、身代わりの杖呪い": 1440,
    "[6]身伐わりの杖、封印の杖、身代わりの杖呪い・買": 545,
    "[5]身伐わりの杖、封印の杖、身代わりの杖呪い・買": 524,
    "[4]身伐わりの杖、封印の杖、身代わりの杖呪い・買": 504,

    "[6]感電の杖、盛電の杖祝福": 1716,
    "[5]感電の杖、盛電の杖祝福": 1650,
    "[4]感電の杖、盛電の杖祝福": 1584,
    "[6]感電の杖、盛電の杖祝福・買": 600,
    "[5]感電の杖、盛電の杖祝福・買": 577,
    "[4]感電の杖、盛電の杖祝福・買": 554,
    "[6]感電の杖、盛電の杖通常": 1560,
    "[5]感電の杖、盛電の杖通常": 1500,
    "[4]感電の杖、盛電の杖通常": 1440,
    "[6]感電の杖、盛電の杖通常・買": 546,
    "[5]感電の杖、盛電の杖通常・買": 525,
    "[4]感電の杖、盛電の杖通常・買": 504,
    "[6]感電の杖、盛電の杖呪い": 1248,
    "[5]感電の杖、盛電の杖呪い": 1200,
    "[4]感電の杖、盛電の杖呪い": 1152,
    "[6]感電の杖、盛電の杖呪い・買": 436,
    "[5]感電の杖、盛電の杖呪い・買": 420,
    "[4]感電の杖、盛電の杖呪い・買": 403,

    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福": 1336,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福": 1287,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福": 1237,
    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福・買": 467,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福・買": 449,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖祝福・買": 432,
    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常": 1215,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常": 1170,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常": 1125,
    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常・買": 425,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常・買": 409,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖通常・買": 393,
    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い": 972,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い": 936,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い": 900,
    "[7]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い・買": 340,
    "[6]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い・買": 327,
    "[5]痛み分けの杖、転ばぬ先の杖、ただの杖、ワナ消しの杖呪い・買": 314,

    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福": 1287,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福": 1237,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福": 1188,
    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福・買": 449,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福・買": 432,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖祝福・買": 415,
    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常": 1170,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常": 1125,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常": 1080,
    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常・買": 409,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常・買": 393,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖通常・買": 378,
    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い": 936,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い": 900,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い": 864,
    "[6]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い・買": 327,
    "[5]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い・買": 314,
    "[4]一時しのぎの杖、かなしばいの杖、かなしばりの杖、転ばぬ先生の杖呪い・買": 302,

    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福": 891,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福": 858,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福": 825,
    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福・買": 311,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福・買": 300,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖祝福・買": 288,
    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常": 810,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常": 780,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常": 750,
    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常・買": 283,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常・買": 273,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖通常・買": 262,
    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い": 648,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い": 624,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い": 600,
    "[7]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い・買": 226,
    "[6]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い・買": 218,
    "[5]飛びつきの杖、場所がえの杖、吹き飛ばしの杖、魔道の杖呪い・買": 209,

    "[6]加速の杖、鈍足の杖祝福": 858,
    "[5]加速の杖、鈍足の杖祝福": 825,
    "[4]加速の杖、鈍足の杖祝福": 792,
    "[6]加速の杖、鈍足の杖祝福・買": 300,
    "[5]加速の杖、鈍足の杖祝福・買": 288,
    "[4]加速の杖、鈍足の杖祝福・買": 277,
    "[6]加速の杖、鈍足の杖通常": 780,
    "[5]加速の杖、鈍足の杖通常": 750,
    "[4]加速の杖、鈍足の杖通常": 720,
    "[6]加速の杖、鈍足の杖通常・買": 273,
    "[5]加速の杖、鈍足の杖通常・買": 262,
    "[4]加速の杖、鈍足の杖通常・買": 252,
    "[6]加速の杖、鈍足の杖呪い": 624,
    "[5]加速の杖、鈍足の杖呪い": 600,
    "[4]加速の杖、鈍足の杖呪い": 576,
    "[6]加速の杖、鈍足の杖呪い・買": 218,
    "[5]加速の杖、鈍足の杖呪い・買": 209,
    "[4]加速の杖、鈍足の杖呪い・買": 201,

  }
  const tubo = {
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺祝福": 13750,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺祝福": 13200,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺祝福": 12650,
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺祝福・買": 4812,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺祝福・買": 4620,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺祝福・買": 4427,
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺通常": 12500,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺通常": 12000,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺通常": 11500,
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺通常・買": 4375,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺通常・買": 4200,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺通常・買": 4025,
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺封印": 10000,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺封印": 9600,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺封印": 9200,
    "[5]強イヒの壺、福寄せの壺、厄寄せの壺封印・買": 3500,
    "[4]強イヒの壺、福寄せの壺、厄寄せの壺封印・買": 3360,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺封印・買": 3220,

    "[3]強イヒの壺、福寄せの壺、厄寄せの壺祝福": 12650,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺祝福": 12100,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺祝福・買": 4427,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺祝福・買": 4235,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺通常": 11500,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺通常": 11000,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺通常・買": 4025,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺通常・買": 3850,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺封印": 9200,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺封印": 8800,
    "[3]強イヒの壺、福寄せの壺、厄寄せの壺封印・買": 3220,
    "[2]強イヒの壺、福寄せの壺、厄寄せの壺封印・買": 3220,

    "[5]合成の壺祝福": 8250,
    "[5]合成の壺祝福・買": 2887,
    "[5]合成の壺通常": 7500,
    "[5]合成の壺通常・買": 2625,
    "[5]合成の壺封印": 6000,
    "[5]合成の壺封印・買": 2100,

    "[5]合城の壺祝福": 8250,
    "[4]合城の壺祝福": 7920,
    "[3]合城の壺祝福": 7590,
    "[5]合城の壺祝福・買": 2887,
    "[4]合城の壺祝福・買": 2772,
    "[3]合城の壺祝福・買": 2656,
    "[5]合城の壺通常": 7500,
    "[4]合城の壺通常": 7200,
    "[3]合城の壺通常": 6900,
    "[5]合城の壺通常・買": 2625,
    "[4]合城の壺通常・買": 2520,
    "[3]合城の壺通常・買": 2415,
    "[5]合城の壺封印": 6000,
    "[4]合城の壺封印": 5760,
    "[3]合城の壺封印": 5520,
    "[5]合城の壺封印・買": 2100,
    "[4]合城の壺封印・買": 2016,
    "[3]合城の壺封印・買": 1932,

    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺祝福": 4812,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺祝福": 4620,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺祝福": 4427,
    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺祝福・買": 1684,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺祝福・買": 1617,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺祝福・買": 1548,
    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺通常": 4375,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺通常": 4200,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺通常": 4025,
    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺通常・買": 1531,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺通常・買": 1470,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺通常・買": 1408,
    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺封印": 3500,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺封印": 3360,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺封印": 3220,
    "[5]クラインの壺、背中の壺、トドの壺、魔物の壺封印・買": 1224,
    "[4]クラインの壺、背中の壺、トドの壺、魔物の壺封印・買": 1176,
    "[3]クラインの壺、背中の壺、トドの壺、魔物の壺封印・買": 1126,

    "[3]笑いの壺祝福": 4427,
    "[2]笑いの壺祝福": 4235,
    "[3]笑いの壺祝福・買": 1548,
    "[2]笑いの壺祝福・買": 1481,
    "[3]笑いの壺通常": 4025,
    "[2]笑いの壺通常": 3850,
    "[3]笑いの壺通常・買": 1408,
    "[2]笑いの壺通常・買": 1347,
    "[3]笑いの壺封印": 3220,
    "[2]笑いの壺封印": 3080,
    "[3]笑いの壺封印・買": 1126,
    "[2]笑いの壺封印・買": 1077,

    "[3]乙女の祈りの壺祝福": 4427,
    "[3]乙女の祈りの壺祝福・買": 4025,
    "[3]乙女の祈りの壺通常": 3220,
    "[3]乙女の祈りの壺通常・買": 1548,
    "[3]乙女の祈りの壺封印": 1408,
    "[3]乙女の祈りの壺封印・買": 1126,

    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福": 3300,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福": 3162,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福": 3025,
    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福・買": 1155,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福・買": 1106,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺祝福・買": 1058,
    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常": 3000,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常": 2875,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常": 2750,
    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常・買": 1050,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常・買": 1006,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺通常・買": 962,
    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印": 2400,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印": 2300,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印": 2200,
    "[4]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印・買": 840,
    "[3]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印・買": 804,
    "[2]冷えびえ香の壺、身かわし香の壺、目配り香の壺、山彦香の壺封印・買": 769,

    "[5]水がめの壺祝福": 2750,
    "[4]水がめの壺祝福": 2640,
    "[3]水がめの壺祝福": 2530,
    "[5]水がめの壺祝福・買": 962,
    "[4]水がめの壺祝福・買": 924,
    "[3]水がめの壺祝福・買": 885,
    "[5]水がめの壺通常": 2500,
    "[4]水がめの壺通常": 2400,
    "[3]水がめの壺通常": 2300,
    "[5]水がめの壺通常・買": 875,
    "[4]水がめの壺通常・買": 840,
    "[3]水がめの壺通常・買": 805,
    "[5]水がめの壺封印": 2000,
    "[4]水がめの壺封印": 1920,
    "[3]水がめの壺封印": 1840,
    "[5]水がめの壺封印・買": 700,
    "[4]水がめの壺封印・買": 672,
    "[3]水がめの壺封印・買": 644,

    "[3]天上の器祝福": 2530,
    "[3]天上の器祝福・買": 885,
    "[3]天上の器通常": 2300,
    "[3]天上の器通常・買": 805,
    "[3]天上の器封印": 1840,
    "[3]天上の器封印・買": 644,
    
    "[4]おはらいの壺、祝福の壺、たたりの壺祝福": 2112,
    "[3]おはらいの壺、祝福の壺、たたりの壺祝福": 2024,
    "[2]おはらいの壺、祝福の壺、たたりの壺祝福": 1936,
    "[4]おはらいの壺、祝福の壺、たたりの壺祝福・買": 739,
    "[3]おはらいの壺、祝福の壺、たたりの壺祝福・買": 708,
    "[2]おはらいの壺、祝福の壺、たたりの壺祝福・買": 677,
    "[4]おはらいの壺、祝福の壺、たたりの壺通常": 1920,
    "[3]おはらいの壺、祝福の壺、たたりの壺通常": 1840,
    "[2]おはらいの壺、祝福の壺、たたりの壺通常": 1760,
    "[4]おはらいの壺、祝福の壺、たたりの壺通常・買": 672,
    "[3]おはらいの壺、祝福の壺、たたりの壺通常・買": 644,
    "[2]おはらいの壺、祝福の壺、たたりの壺通常・買": 616,
    "[4]おはらいの壺、祝福の壺、たたりの壺封印": 1536,
    "[3]おはらいの壺、祝福の壺、たたりの壺封印": 1472,
    "[2]おはらいの壺、祝福の壺、たたりの壺封印": 1408,
    "[4]おはらいの壺、祝福の壺、たたりの壺封印・買": 537,
    "[3]おはらいの壺、祝福の壺、たたりの壺封印・買": 515,
    "[2]おはらいの壺、祝福の壺、たたりの壺封印・買": 492,

    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福": 1375,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福": 1320,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福": 1265,
    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福・買": 480,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福・買": 462,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺祝福・買": 442,
    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常": 1250,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常": 1200,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常": 1150,
    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常・買": 437,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常・買": 420,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺通常・買": 402,
    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印": 1000,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印": 960,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印": 920,
    "[5]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印・買": 349,
    "[4]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印・買": 336,
    "[3]換金の壺、手封じの壺、フィーバーの壺、変化の壺、変花の壺、割れない壺封印・買": 321,

    "[4]底抜けの壺祝福": 1320,
    "[3]底抜けの壺祝福": 1265,
    "[2]底抜けの壺祝福": 1210,
    "[4]底抜けの壺祝福・買": 462,
    "[3]底抜けの壺祝福・買": 442,
    "[2]底抜けの壺祝福・買": 423,
    "[4]底抜けの壺通常": 1200,
    "[3]底抜けの壺通常": 1150,
    "[2]底抜けの壺通常": 1100,
    "[4]底抜けの壺通常・買": 420,
    "[3]底抜けの壺通常・買": 402,
    "[2]底抜けの壺通常・買": 385,
    "[4]底抜けの壺封印": 960,
    "[3]底抜けの壺封印": 920,
    "[2]底抜けの壺封印": 880,
    "[4]底抜けの壺封印・買": 336,
    "[3]底抜けの壺封印・買": 321,
    "[2]底抜けの壺封印・買": 308,
    
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福": 825,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福": 792,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福": 759,
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福・買": 288,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福・買": 277,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢祝福・買": 265,
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常": 750,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常": 720,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常": 690,
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常・買": 262,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常・買": 252,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢通常・買": 241,
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印": 600,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印": 576,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印": 552,
    "[5]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印・買": 209,
    "[4]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印・買": 201,
    "[3]識別の壺、ただの壺、保存の壺、やりすごしの壺、四二鉢封印・買": 192,


    
  }
  const iteme = {
    ...udewa,
    ...kusa,
    ...makimono,
    ...tuue,
    ...tubo,
  };

  //////    ↓定数宣言↓    /////
  const next = document.getElementById("next"); //ca
  const prev = document.getElementById("prev");
  const ul = document.querySelector("ul");
  const slides = ul.children;
  let currentIdx = 0;
  const dots = [];
  const keys0 = Object.keys(iteme);
  const keys = Object.keys(udewa);//オブジェクトを配列に変換
  const keys2 = Object.keys(kusa);
  const keys3 = Object.keys(tuue);
  const keys4 = Object.keys(tubo);
  const p0 = document.createElement("p");
  const p1 = document.createElement("p");
  const p2 = document.createElement("p");
  const p3 = document.createElement("p");
  const p4 = document.createElement("p");
  const text0 = document.getElementById("number0");
  const text1 = document.getElementById("number1");
  const text2 = document.getElementById("number2");
  const text3 = document.getElementById("number3");
  const text4 = document.getElementById("number4");
  const bottton0 = document.getElementById("button0");
  const bottton1 = document.getElementById("button1");
  const bottton2 = document.getElementById("button2");
  const bottton3 = document.getElementById("button3");
  const bottton4 = document.getElementById("button4");
  const bottton5 = document.getElementById("button5");
  const divid0 = document.getElementById("div0");
  const divid1 = document.getElementById("div1");
  const divid2 = document.getElementById("div2");
  const divid3 = document.getElementById("div3");
  const divid4 = document.getElementById("div4");

  //////    ↓メソッド関数宣言↓    /////
  
  //繰り返し処理の関数
  function keyif0(e){
    p0.textContent = "";
    keys0.forEach(key => {
      e.preventDefault();
      if(`${iteme[key]}` === text0.value){
        p0.textContent += `${key}。`;
      }
    });
  }
  function keyif(e){
    p1.textContent = "";
    keys.forEach(key => {
      e.preventDefault();
      if(`${iteme[key]}` === text1.value){
        p1.textContent += `${key}。`;
      }
    });
  }
  function keyif2(e){
    p2.textContent = "";
    keys2.forEach(key => {
      e.preventDefault();
      if(`${iteme[key]}` === text2.value){
        p2.textContent += `${key}。`;
      }
    });
  }
  function keyif3(e){
    p3.textContent = "";
    keys3.forEach(key => {
      e.preventDefault();
      if(`${iteme[key]}` === text3.value){
        p3.textContent += `${key}。`;
      }
    });
  }
  function keyif4(e){
    p4.textContent = "";
    keys4.forEach(key => {
      e.preventDefault();
      if(`${iteme[key]}` === text4.value){
        p4.textContent += `${key}。`;
      }
    });
  }
  //carouselメソッド
  function updateButtons(){
    prev.classList.remove("hidden");
    next.classList.remove("hidden");
    if (currentIdx === 0){
      prev.classList.add("hidden");
    }
    if (currentIdx === slides.length - 1){
      next.classList.add("hidden");
    }
  }
  function moveSlides(){
    const slideWidht = slides[0].getBoundingClientRect().width;
    ul.style.transform = `translateX(${-1 * slideWidht * currentIdx}px)`;
  }
  function setupDots(){
    for (let i = 0; i < slides.length; i++){
      const button = document.createElement("button");
      button.addEventListener("click", () => {
        currentIdx = i;
        updateDBmS();
      });
      dots.push(button);
      document.querySelector("nav").appendChild(button);
    }
    dots[0].classList.add("current");
  }
  function updateDots(){
    dots.forEach(dot => {
      dot.classList.remove("current");
    });
    dots[currentIdx].classList.add("current");
  }
  function updateDBmS(){
    updateDots();
    updateButtons();
    moveSlides();
  }
  //////    ↑メソッド関数宣言↑    /////


  /////    ↓イベント↓    /////
  updateButtons();
  //////    ↓carouselイベント↓    /////
  setupDots();
  next.addEventListener("click", () => {
    currentIdx++;
    updateDBmS();
  });
  prev.addEventListener("click", () => {
    currentIdx--;
    updateDBmS();
  });
  ///
  //////    ↑carouselイベント↑    /////
  ////

  ////
  /////     ↓メインクリックイベント↓      /////
  ////
  bottton0.addEventListener("click", e => keyif0(e));
  bottton1.addEventListener("click", e => keyif(e));
  bottton2.addEventListener("click", e => keyif2(e));
  bottton3.addEventListener("click", e => keyif3(e));
  bottton4.addEventListener("click", e => keyif4(e));
  

  ///
  /////    ↑メインクリックイベント↑      /////
  ///
  ///
  ////    ↓メイン↓      /////
  divid0.appendChild(p0);
  divid1.appendChild(p1);
  divid2.appendChild(p2);
  divid3.appendChild(p3);
  divid4.appendChild(p4);
  ////      window.       ////
  window.addEventListener("resize", () => {
    moveSlides();
  });

}